bluestore/nvme/rw-1M.out
nvme-direct: (g=0): rw=rw, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
fio-3.1
Starting 1 process

nvme-direct: (groupid=0, jobs=1): err= 0: pid=1536667: Fri Jun 19 02:05:23 2020
   read: IOPS=854, BW=855MiB/s (896MB/s)(50.1GiB/60020msec)
    slat (usec): min=65, max=24183, avg=140.89, stdev=626.19
    clat (usec): min=860, max=34565, avg=4860.61, stdev=2881.69
     lat (usec): min=978, max=36135, avg=5002.29, stdev=2937.48
    clat percentiles (usec):
     |  1.00th=[ 1270],  5.00th=[ 1631], 10.00th=[ 1991], 20.00th=[ 2638],
     | 30.00th=[ 3261], 40.00th=[ 3785], 50.00th=[ 4293], 60.00th=[ 4883],
     | 70.00th=[ 5669], 80.00th=[ 6587], 90.00th=[ 7963], 95.00th=[ 9503],
     | 99.00th=[17433], 99.50th=[19268], 99.90th=[23200], 99.95th=[24773],
     | 99.99th=[28181]
   bw (  KiB/s): min=716800, max=1028096, per=100.00%, avg=875404.17, stdev=51433.26, samples=240
   iops        : min=  700, max= 1004, avg=854.90, stdev=50.22, samples=240
  write: IOPS=851, BW=852MiB/s (893MB/s)(49.9GiB/60020msec)
    slat (usec): min=55, max=24708, avg=125.74, stdev=593.36
    clat (usec): min=2171, max=65316, avg=32418.64, stdev=6058.93
     lat (usec): min=2259, max=65416, avg=32545.18, stdev=6013.63
    clat percentiles (usec):
     |  1.00th=[17171],  5.00th=[23462], 10.00th=[25297], 20.00th=[27657],
     | 30.00th=[29230], 40.00th=[30802], 50.00th=[32375], 60.00th=[33817],
     | 70.00th=[35390], 80.00th=[36963], 90.00th=[40109], 95.00th=[42206],
     | 99.00th=[47449], 99.50th=[50070], 99.90th=[54789], 99.95th=[56886],
     | 99.99th=[60556]
   bw (  KiB/s): min=733184, max=1015808, per=99.98%, avg=871883.72, stdev=49808.98, samples=240
   iops        : min=  716, max=  992, avg=851.44, stdev=48.64, samples=240
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=5.09%, 4=17.42%, 10=25.64%, 20=2.61%, 50=48.98%
  lat (msec)   : 100=0.25%
  cpu          : usr=1.59%, sys=20.22%, ctx=79114, majf=0, minf=8251
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=51300,51113,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=855MiB/s (896MB/s), 855MiB/s-855MiB/s (896MB/s-896MB/s), io=50.1GiB (53.8GB), run=60020-60020msec
  WRITE: bw=852MiB/s (893MB/s), 852MiB/s-852MiB/s (893MB/s-893MB/s), io=49.9GiB (53.6GB), run=60020-60020msec

Disk stats (read/write):
  nvme0n1: ios=409882/413419, merge=0/3094, ticks=1393645/9590865, in_queue=9382420, util=99.90%